# Rpstr_RemoveValue

## Description
Removes a named value from the VectorScript value repository.

```pascal
FUNCTION Rpstr_RemoveValue(name : STRING) : BOOLEAN;
```

```python

def vs.Rpstr_RemoveValue(name):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|The name of the value.|

## Returns
Return true if the value was found and removed.

## See Also
VS Functions:
Rpstr_RemoveValues| Rpstr_RemoveValue| Rpstr_GetValueBool| Rpstr_SetValueBool| Rpstr_GetValueInt| Rpstr_SetValueInt| Rpstr_GetValueReal| Rpstr_SetValueReal| Rpstr_GetValueStr| Rpstr_SetValueStr

## Version
Availability: from Vectorworks 2012
## Category
* Utility